##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
# Примечание: сторону квадрата получаем через функцию input().
# x = 10
# print(x)

x = int(input())
y = int(input())
print(x + y, x - y, x / y, x * y, x % y, x // y, x ** y)
